Tests:
  -
    name: "Example test 1"
    description: "Example test 1"
    command: './107transfer "0*1*2*3*4" "1" | head -n 12'
    testType: "expect"
    expected:
      stdout: 
        string:  "0.000 -> 0.00000\n0.001 -> 0.00100\n0.002 -> 0.00201\n0.003 -> 0.00302\n0.004 -> 0.00403\n0.005 -> 0.00505\n0.006 -> 0.00607\n0.007 -> 0.00710\n0.008 -> 0.00813\n0.009 -> 0.00916\n0.010 -> 0.01020\n0.011 -> 0.01125\n"

  -
    name: "Example test 2"
    description: "Example test 2"
    command: './107transfer "0*1*2*3*4" "1" | tail'
    testType: "expect"
    expected:
      stdout: 
        string:  "0.991 -> 9.73282\n0.992 -> 9.76223\n0.993 -> 9.79171\n0.994 -> 9.82126\n0.995 -> 9.85087\n0.996 -> 9.88056\n0.997 -> 9.91031\n0.998 -> 9.94014\n0.999 -> 9.97003\n1.000 -> 10.00000\n"

  -
    name: "Example test 3"
    description: "Example test 3"
    command: './107transfer "0*0*9" "1*3*5" "2*4*6" "8*8*8" | head'
    testType: "expect"
    expected:
      stdout: 
        string: "0.000 -> 0.00000\n0.001 -> 0.00000\n0.002 -> 0.00001\n0.003 -> 0.00002\n0.004 -> 0.00004\n0.005 -> 0.00006\n0.006 -> 0.00008\n0.007 -> 0.00011\n0.008 -> 0.00014\n0.009 -> 0.00018\n"

  -
    name: "Rigor"
    description: "Rigor test 1"
    command: './107transfer "0*0*9" "1*3**5" "2*4*6" "8*8*8"'
    testType: "expect"
    expected:
      exitCode: 84

  -
    name: "Help"
    description: "Help test"
    command: './107transfer -h'
    testType: "expect"
    expected:
      stdout:
        string: "USAGE\n    ./107transfer [num den]+\nDESCRIPTION\n    num    polynomial numerator defined by its coefficients\n    den    polynomial denominator defined by its coefficients\n"